# MaxSpacing Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
Rebar..::..MaxSpacing Property
Rebar Class See Also
---
Identifies the maximum spacing between rebar in rebar set.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2009
# Syntax
C#
---
```text
public double MaxSpacing { get; set; }
```

Visual Basic
---
```text
Public Property MaxSpacing As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double MaxSpacing {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The maxSpacing isn't bigger than 0.0. |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | When setting this property: None of the following disciplines is enabled: Structural. |
| Autodesk.Revit.Exceptions..::..InapplicableDataException | This rebar element represents a single bar (the layout rule is Single). |

# See Also
Rebar Class
Autodesk.Revit.DB.Structure Namespace